"""
Задача №1.
Дан массив чисел, состоящий из некоторого количества подряд идущих единиц, за которыми следует какое-то
количество подряд идущих нулей: 111111111111111111111111100000000.
Найти индекс первого нуля (то есть найти такое место, где заканчиваются единицы, и начинаются нули)
def task(array):
    pass

print(task("111111111110000000000000000"))
# >> OUT: 10
"""


def task_1(array):
    return array.find('0') - 1

print(task_1("111111111110000000000000000"))  # 10


"""
В функцию передаются координаты двух противоположных вершин одного прямоугольника
и двух противоположных вершин второго прямоугольника. Найти, пересекаются ли эти прямоугольники?
Немного посложнее – найти площадь пересечения

def task(x1,y1,x2,y2,x3,y3,x4,y4):
    pass

print(task(1,1,2,2,3,3,4,4))
# >> OUT: False
"""


def task_1_2(x1, y1, x2, y2, x3, y3, x4, y4):
    """
    Находим пересечения прямоугольников с помощью set_1.intersection(set_2)
    """
    dx = set(range(x1, x2)) & set(range(x3, x4))
    dy = set(range(y2, y1)) & set(range(y3, y4))  # range(y2, y1) а не range(y1, y2) из-за условий задачи
    s = len(dx) * len(dy)
    if s:
        return f"Прямоугольники пересекаются. Площадь пересечения - {s}"
    return "Прямоугольники не пересекаются"


print(task_1_2(1, 1, 2, 2, 3, 3, 4, 4))  # не пересекаются
print(task_1_2(-10, 6, -8, 4, -9, 5, -7, 7))  # пересекаются, площадь пересечения - 1

